/* ErrH-r04-3000-0200-b-v00 */
/************************************************************************************************/
/*																								*/
/*		ErrH Driver																				*/
/*																								*/
/*		Copyright : DENSO CORPORATION															*/
/*																								*/
/************************************************************************************************/

#if 0 // zantei MPUは2月末非対応

#ifndef ErrH_PEG_H
#define ErrH_PEG_H

/*==============================================================================================*/
/*	include files																				*/
/*==============================================================================================*/
#include	"errh_reg_peg.h"

/*==============================================================================================*/
/* defines / data types / structs / unions	/ macros											*/
/*==============================================================================================*/
/* PEG Protection Setting Type Definition */
typedef	struct
{
	U4		u4Addv;							/* チャネル有効ビット設定 */
	U4		u4Base;							/* チャネルベースアドレス設定 */
	U4		u4Prot;							/* チャネル保護制御 */
	U4		u4Spid;							/* チャネル SPID 設定 */
}	ErrH_PegProtSetType;

/*==============================================================================================*/
/* functions																					*/
/*==============================================================================================*/
/*----------------------------------------------------------------------------------------------*/
/* API Functions																				*/
/*----------------------------------------------------------------------------------------------*/
/************************************************************************************************/
/* Service name 	:	Set Mode & Start Guard													*/
/* Reentrancy		:	Non Re-entrant															*/
/* Parameters (in)	:	Area - ID of Area Number( AREA_ID0 / 1 / 2 / 3 / 4 / 5 / 6 / 7 )		*/
/*					:	Core - Core0/Core1/Core2( 0 / 1 /2 )									*/
/*					:	*ProtectionSetting(Sync)												*/
/* Return value 	:	none																	*/
/* Caveats			:	・本APIはコア0からのコールに限定する。									*/
/*					:	・本APIはInit時の使用に限定する。										*/
/************************************************************************************************/
void	ErrH_Peg_SetModeStartGuard( U1 t_u1Area , U1 t_u1Core , const ErrH_PegProtSetType *t_pcstProtSet );

/************************************************************************************************/
/* Service name		:	PEG Clear Error															*/
/* Reentrancy		:	Re-entrant																*/
/* Parameters (in)	:	Core - Core0/Core1/Core2( 0 / 1 /2 )									*/
/*					:	ModuleNum - PEG Module Number( 0 / 1  )									*/
/* Return value		:	none																	*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
void	ErrH_Peg_ClearError( U1 t_u1Core, U2 t_u2ModuleNum );

/************************************************************************************************/
/* Service name		:	PEG Get Error Status													*/
/* Reentrancy		:	Concurrency Safe														*/
/* Parameters (in)	:	Core - Core0/Core1/Core2( 0 / 1 /2 )									*/
/*					:	ModuleNum - PEG Module Number( 0 / 1  )									*/
/* Return value		:	Error Status															*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
U4	ErrH_Peg_GetErrStatus( U1 t_u1Core, U2 t_u2ModuleNum );

/************************************************************************************************/
/* Service name		:	PEG Get Error Address													*/
/* Reentrancy		:	Concurrency Safe														*/
/* Parameters (in)	:	Core - Core0/Core1/Core2( 0 / 1 /2 )									*/
/*					:	ModuleNum - PEG Module Number( 0 / 1  )									*/
/* Return value		:	Error Address															*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
U4	ErrH_Peg_GetErrAddress( U1 t_u1Core, U2 t_u2ModuleNum );

/************************************************************************************************/
/* Service name		:	PEG Get Error Access Info												*/
/* Reentrancy		:	Concurrency Safe														*/
/* Parameters (in)	:	Core - Core0/Core1/Core2( 0 / 1 /2 )									*/
/*					:	ModuleNum - PEG Module Number( 0 / 1  )									*/
/* Return value		:	Error Access info														*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
U4	ErrH_Peg_GetErrAccessInfo( U1 t_u1Core, U2 t_u2ModuleNum );


/*----------------------------------------------------------------------------------------------*/
/* Scheduled / Event Functions																	*/
/*----------------------------------------------------------------------------------------------*/


#endif /* ErrH_PEG_H */
#endif // zantei MPUは2月末非対応
/*-- End Of File -------------------------------------------------------------------------------*/
