/* PwrCtrl_Com                                                              */
/****************************************************************************/
/* Protected                                                                */
/* Copyright DENSO CORPORATION                                              */
/****************************************************************************/

/****************************************************************************/
/* Object Name | PwrCtrl_Com/HEADER                                         */
/*--------------------------------------------------------------------------*/
/* Notes       |                                                            */
/****************************************************************************/
#ifndef PWRCTRL_COM_H
#define PWRCTRL_COM_H

/*--------------------------------------------------------------------------*/
/* Macros                                                                   */
/*--------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------*/
/* Function Prototypes                                                      */
/*--------------------------------------------------------------------------*/
/* ã§í  */
void vd_g_PwrCtrlComBonInit( void );
void vd_g_PwrCtrlComWkupInit( void );

/* éÛêM */
void vd_g_PwrCtrlComRxTask( void );
U1 u1_g_PwrCtrlComGetSoCSts( void );
U1 u1_g_PwrCtrlComGetSoCResetReq( void );

/* ëóêM */
void vd_g_PwrCtrlComTxTask( void );
void vd_g_PwrCtrlComTxSetSoCOnStart( void );

#endif /* PWRCTRL_OBSERVE_H */

/**** End of File ***********************************************************/
