/* PwrCtrl_Main                                                                              */
/*********************************************************************************************/
/* Protected                                                                                 */
/* Copyright DENSO CORPORATION                                                               */
/*********************************************************************************************/

/*********************************************************************************************/
/* Object Name | PwrCtrl_Main/HEADER                                                         */
/*-------------------------------------------------------------------------------------------*/
/* Notes       |                                                                             */
/*********************************************************************************************/
#ifndef PWRCTRL_MAIN_H
#define PWRCTRL_MAIN_H

/*-------------------------------------------------------------------------------------------*/
/* Macros                                                                                    */
/*-------------------------------------------------------------------------------------------*/
/* 電源制御状態 */
#define PWRCTRL_MAIN_BON_REQ               (0x00U) /* +B起動シーケンス要求                   */
#define PWRCTRL_MAIN_WAKEUP_REQ            (0x01U) /* ウェイクアップシーケンス要求           */
#define PWRCTRL_MAIN_SIPOFF_MCUSTANDBY_REQ (0x02U) /* SIP電源OFF&MCUスタンバイシーケンス要求 */
#define PWRCTRL_MAIN_STANDBY_REQ           (0x03U) /* スタンバイシーケンス要求               */
#define PWRCTRL_MAIN_NO_REQ                (0xFFU) /* 要求無し(処理完了)                     */
/*-------------------------------------------------------------------------------------------*/
/* Function Prototypes                                                                       */
/*-------------------------------------------------------------------------------------------*/
void vd_g_PwrCtrlMainBonReq( void );
void vd_g_PwrCtrlMainWakeupReq( void );
void vd_g_PwrCtrlMainStandbyReq( void );
void vd_g_PwrCtrlMainTask( void );

U1 u1_g_PwrCtrlMainShtdwnOk( void );

#endif /* PWRCTRL_MAIN_H */

/**** End of File ****************************************************************************/
