/* Fee_Area.c v1-0-0                                                        */
/****************************************************************************/
/* Protected                                                                */
/* Copyright AUBASS CO., LTD.                                               */
/****************************************************************************/

/****************************************************************************/
/* Object Name  | FEE/AREA/CODE                                             */
/*--------------------------------------------------------------------------*/
/* Notes        |                                                           */
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/* Include Files                                                            */
/*--------------------------------------------------------------------------*/
#include <Fee.h>

#include "../inc/Fee_Mpu_Dev_Const.h"

/* MHA[データFlash]I/Fヘッダ */
#include "../inc/Fee_Legacy.h"

/* MHA[データFlash]ヘッダ */
#include "../inc/Fee_Lib.h"

/* MHA[データFlash]ライブラリヘッダ */
#include "../inc/Fee_Common.h"


/* D.F.C.ヘッダ */
#include "../inc/Fee_Dfc.h"

#include "../inc/Fee_Ram.h"

/*--------------------------------------------------------------------------*/
/* Types                                                                    */
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* Macros                                                                   */
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* Function Prototypes                                                      */
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* Data                                                                     */
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* Constants                                                                */
/*--------------------------------------------------------------------------*/
/****************************************************************************/
/* External Functions                                                       */
/****************************************************************************/
#define FEE_START_SEC_CODE
#include <Fee_MemMap.h>

/*関数説明--------------------------------------------------------------------*/
/* 説  明        ：使用エリア選択                                             */
/* 入  力        ：stCPUDTF *ptstCPUDTFInfo                            */
/*                                           ：MHA[データFlash]管理データ     */
/* 出  力        ：なし                                                       */
/* グローバル変数：                                                           */
/* その他        ：                                                           */
/*----------------------------------------------------------------------------*/
FUNC(void, FEE_CODE) Fee_SelectUseArea( P2VAR(Fee_CpuDtfType, AUTOMATIC, TYPEDEF) ptstCPUDTFInfo )
{
    uint32          u4tCounter;                         /* カウンタ */
    uint8           u1tBlockNum;                        /* ブロック数 */
    uint8           u1tStartBlockNo;                    /* 開始ブロック番号 */
    uint8           u1tAreaNum;                         /* エリア数 */

    /* エリア番号取り出し */
    u1tAreaNum = ptstCPUDTFInfo->u1AreaNum;

    /* エリア依存データ構造体を設定 */
    ptstCPUDTFInfo->ptstAreaInf = (volatile const Fee_AreaInfType *)( &Fee_AreaInfTBL[u1tAreaNum] );

    /* ブロック数テーブルからブロック数取り出し */
    u1tBlockNum = ptstCPUDTFInfo->ptstAreaInf->u1BlockNum;
    /* 開始ブロック番号取り出し */
    u1tStartBlockNo = ptstCPUDTFInfo->ptstAreaInf->u1AreaStartBlockNum;
    /* 全ブロック終了するまでループ */
    for ( u4tCounter = 0U; u4tCounter < (uint32)u1tBlockNum; u4tCounter++ )
    {
        /* 使用中ブロックデータ構造体にブロック番号を設定 */
        Fee_UseBlockInfo[u4tCounter].u1BlockNo = (uint8)(u1tStartBlockNo + u4tCounter);
    }

    return;
}

#define FEE_STOP_SEC_CODE
#include <Fee_MemMap.h>

/****************************************************************************/
/* History                                                                  */
/*  Version        :Date                                                    */
/*  1-0-0          :2019/02/01                                              */
/****************************************************************************/

/**** End of File ***********************************************************/
