/* Fee_Legacy.c v2-0-0                                                      */
/****************************************************************************/
/* Protected                                                                */
/* Copyright AUBASS CO., LTD.                                               */
/****************************************************************************/

/****************************************************************************/
/* Object Name  | FEE/LEGACY/CODE                                           */
/*--------------------------------------------------------------------------*/
/* Notes        |                                                           */
/****************************************************************************/
/*--------------------------------------------------------------------------*/
/* Include Files                                                            */
/*--------------------------------------------------------------------------*/
#include <Fee.h>

#include "../inc/Fee_Mpu_Dev_Const.h"

/* MHA[データFlash]I/Fヘッダ */
#include "../inc/Fee_Legacy.h"

/* MHA[データFlash]ヘッダ */
#include "../inc/Fee_Lib.h"


#include "../inc/Fee_Ram.h"


/*--------------------------------------------------------------------------*/
/* Types                                                                    */
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* Macros                                                                   */
/*--------------------------------------------------------------------------*/
/* ↓↓↓コンフィグ設定（ユーザ編集不可）↓↓↓ */

/* エリアステータスデータ１のオフセット */
#define FEE_AREASTATUSPOS1      ((uint8)0x00U)
/* エリアステータスデータ２のオフセット */
#define FEE_AREASTATUSPOS2      ((uint8)(FEE_AREASTATUSPOS1 + (FEE_READ_UNIT_SIZE * 7U)))
/* ブロックステータスデータ【使用済１】のオフセット */
#define FEE_BLS_USEDPOS1            ((uint8)(FEE_READ_UNIT_SIZE * 1U))
/* ブロックステータスデータ【使用済２】のオフセット */
#define FEE_BLS_USEDPOS2            ((uint8)(FEE_BLS_USEDPOS1 + (FEE_READ_UNIT_SIZE * 5U)))
/* ブロックステータスデータ【転送中１】のオフセット */
#define FEE_BLS_MOVEPOS1            ((uint8)(FEE_READ_UNIT_SIZE * 2U))
/* ブロックステータスデータ【転送中２】のオフセット */
#define FEE_BLS_MOVEPOS2            ((uint8)(FEE_BLS_MOVEPOS1 + (FEE_READ_UNIT_SIZE * 3U)))
/* ブロックステータスデータ【使用中１】のオフセット */
#define FEE_BLS_USEPOS1         ((uint8)(FEE_READ_UNIT_SIZE * 3U))
/* ブロックステータスデータ【使用中２】のオフセット */
#define FEE_BLS_USEPOS2         ((uint8)(FEE_BLS_USEPOS1 + (FEE_READ_UNIT_SIZE * 1U)))

/*--------------------------------------------------------------------------*/
/* Function Prototypes                                                      */
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* Constants                                                                */
/*--------------------------------------------------------------------------*/
#define FEE_START_SEC_CONST_32
#include <Fee_MemMap.h>

/* 書込みHardware待ち時間閾値 */
CONST(AB_83_ConstV uint32, FEE_CONST) Fee_HwLmtWriteTime = FEE_TIMEOUT_PERIODIC_FLS_WRITE;
/* エリア・ブロックステータスデータアドレス */
/* 定義の順番は、ブロックステータス種別の順番に合わせること */
CONST(AB_83_ConstV uint8, FEE_CONST) Fee_ASBSDataTBL[FEE_ASBSDATASETNUM][FEE_ASBSDATAKINDNUM] = 
{
    {FEE_AREASTATUSPOS1,        /* エリアステータスデータ１ */
    FEE_BLS_USEPOS1,            /* ブロックステータスデータ【使用中１】 */
    FEE_BLS_MOVEPOS1,           /* ブロックステータスデータ【転送中１】 */
    FEE_BLS_USEDPOS1},          /* ブロックステータスデータ【使用済１】 */

    {FEE_AREASTATUSPOS2,        /* エリアステータスデータ２ */
    FEE_BLS_USEPOS2,            /* ブロックステータスデータ【使用中２】 */
    FEE_BLS_MOVEPOS2,           /* ブロックステータスデータ【転送中２】 */
    FEE_BLS_USEDPOS2}           /* ブロックステータスデータ【使用済２】 */
};

#define FEE_STOP_SEC_CONST_32
#include <Fee_MemMap.h>

/*--------------------------------------------------------------------------*/
/* Data                                                                     */
/*--------------------------------------------------------------------------*/
/****************************************************************************/
/* External Functions                                                       */
/****************************************************************************/


/****************************************************************************/
/* History                                                                  */
/*  Version        :Date                                                    */
/*  1-0-0          :2019/02/01                                              */
/*  2-0-0          :2021/03/18                                              */
/****************************************************************************/

/**** End of File ***********************************************************/
