/****************************************************************************
 *
 * CRI Middleware SDK
 *
 * Copyright (c) 2023 CRI Middleware Co., Ltd.
 *
 * Library  : CRI Atom
 * Module   : Version of Library User's Header for Automotive
 * File     : cri_atom_at_ver.h
 *
 ****************************************************************************/
/*!
 *	\file		cri_atom_at_ver.h
 */

/* 多重定義防止					*/
/* Prevention of redefinition	*/
#ifndef CRI_INCL_CRI_ATOM_AT_VER_H
#define CRI_INCL_CRI_ATOM_AT_VER_H

/***************************************************************************
 *      インクルードファイル
 *      Include files
 ***************************************************************************/

/***************************************************************************
 *      定数マクロ
 *      Macro Constants
 ***************************************************************************/
/* バージョン情報 */
/* Version Number */
#define CRI_ATOM_AT_VERSION				(0x00840000U)
#define CRI_ATOM_AT_VER_NUM				".84.00"
#define CRI_ATOM_AT_VER_NAME			"CRI Atom Automotive"

/***************************************************************************
 *      処理マクロ
 *      Macro Functions
 ***************************************************************************/

/***************************************************************************
 *      データ型宣言
 *      Data Type Declarations
 ***************************************************************************/

/***************************************************************************
 *      関数宣言
 *      Prototype Functions
 ***************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif


#ifdef __cplusplus
}
#endif
#endif	/* CRI_INCL_CRI_ATOM_AT_VER_H */

/* --- end of file --- */
