/****************************************************************************/
/*	Copyright DENSO Corporation. All rights reserved.                       */
/****************************************************************************/
/*************************************************************************//**
 * @file	L3R_GwBuffer.h
 * @brief	
 * @details	
 * @note	なし
 * @date	v1.00	2018/01/20	T.Totsuka(FSI)		新規作成
 * 			v1.01	2018/05/11	A.Yasui(FSI)		中継のCHとPRTCL_BITの命名規則明確化レベルアップ
 * 			v1.02	2018/05/21	K.Ito(FSI)			2段バッファ削除対応
 * 			v2.00	2018/08/24	K.Ito(FSI)			クラス型統一
 *			v3.00	2018/11/21	Y.Katayama(FSI)		中継改善(オブジェクト不変）
 ****************************************************************************/

/*--------------------------------------------------------------------------*/
/*		２重インクルード防止												*/
/*--------------------------------------------------------------------------*/
#ifndef	L3R_GWBUFFER_H
#define	L3R_GWBUFFER_H


/*--------------------------------------------------------------------------*/
/*		ファイルインクルード												*/
/*--------------------------------------------------------------------------*/
#include "Std_Types.h"

#include "L3R_DynamicBuffer.h"


/*--------------------------------------------------------------------------*/
/*		マクロ定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*		タイプ宣言															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*		外部公開変数														*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*		関数マクロ															*/
/*--------------------------------------------------------------------------*/
/**
 * @fn			GwBuffer_ClrSndStatusCh(self, ch)
 * @brief		送信ステータスクリア処理
 * @details		GW-IDの送信Ch毎の送信ステータスをクリアする
 * @param[in]	self	自身へのポインタ
 * @param[in]	ch		送信Ch
 * @return		なし
 * @attention	なし
 * @note		なし
 */
#define	GwBuffer_ClrSndStatusCh(self, ch) CommonBuffer_ClrSndStatusCh((self), (ch))

/**
 * @fn			GwBuffer_ClrSndStatusPrtcl(self, targetPrtclBit)
 * @brief		送信ステータスクリア処理
 * @details		GW-IDの送信Ch毎の送信ステータスをクリアする
 * @param[in]	self			自身へのポインタ
 * @param[in]	targetPrtclBit	送信Chビット情報
 * @return		なし
 * @attention	なし
 * @note		なし
 */
#define	GwBuffer_ClrSndStatusPrtcl(self, targetPrtclBit) CommonBuffer_ClrSndStatusPrtcl((self), (targetPrtclBit))


/*--------------------------------------------------------------------------*/
/*		プロトタイプ宣言													*/
/*--------------------------------------------------------------------------*/
#define GW_L3R_START_SEC_CODE
#include "GW_L3R_Memmap.h"
extern void GwBuffer_Init(CommonBuffer *self);
extern uint8 GwBuffer_GetGwData(CommonBuffer *self, uint8 ch, uint8 *pDlc, uint32 *pCanid32, uint8 **ppData);
#define GW_L3R_STOP_SEC_CODE
#include "GW_L3R_Memmap.h"


/*--------------------------------------------------------------------------*/
/*		２重インクルード防止												*/
/*--------------------------------------------------------------------------*/
#endif	/* L3R_GWBUFFER_H */
