/*****************************************************************************
 *	Copyright DENSO Corporation. All rights reserved.
 ****************************************************************************/
/*****************************************************************************
 *【ファイル名】	Ecu_Arb_Callout.h
 *【モジュール名】	Arbitration
 *【機能】
 *【備考】
 ****************************************************************************/
#ifndef ECU_ARB_CALLOUT_H
#define ECU_ARB_CALLOUT_H

/*----------------------------------------------------------------------------
 *		Headers
 *--------------------------------------------------------------------------*/
#include <Ecu_Arb_Cfg.h>
/*----------------------------------------------------------------------------
 *		置換シンボル定義
 *--------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *		プロトタイプ宣言
 *--------------------------------------------------------------------------*/

#if (ECU_MY_VM == VMm)
void    Ecu_Arb_entryPrpSlpCallout(void);
void    Ecu_Arb_stopPrpSlpCallout(void);
boolean Ecu_Arb_prpSlpCallout(void);
void    Ecu_Arb_exitInitCallout(void);
#endif
void Ecu_Arb_awakeMskCallout(void);
void Ecu_Arb_awakeUnMskCallout(void);

#endif /* ECU_ARB_CALLOUT_H */
