/* -------------------------------------------------------------------------- */
/* file name   : EthDLC_PowerState.c                                          */
/* -------------------------------------------------------------------------- */
#include <Std_Types.h>
/* -------------------------------------------------------------------------- */
/* - OEM Custom --------- */
/* - OEM Custom --------- */
/* -------------------------------------------------------------------------- */
#define EthDLC_START_SEC_CODE
#include <EthDLC_MemMap.h>
/* -------------------------------------------------------------------------- */
Std_ReturnType EthDLC_Power_GetState (void)
{
	Std_ReturnType	state = STD_OFF;

/* - OEM Custom --------- */
	/* TMC C-DC VISから車両電源基本ステートを取得して判断する	*/
	/* 暫定でONを返す								*/
	state = STD_ON;
/* - OEM Custom --------- */

	return state;
}
/* -------------------------------------------------------------------------- */
#define EthDLC_STOP_SEC_CODE
#include <EthDLC_MemMap.h>
/* -------------------------------------------------------------------------- */
