/* 0.0.0 */
/*===================================================================================================================================*/
/*  Copyright DENSO Corporation                                                                                                      */
/*===================================================================================================================================*/
/*  Mic Power Control & Detection Specification (26CDC)                                                                              */
/*===================================================================================================================================*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version                                                                                                                          */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#define MIC_DETECT_C_MAJOR                      (0)
#define MIC_DETECT_C_MINOR                      (0)
#define MIC_DETECT_C_PATCH                      (0)

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Include Files                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#include "MicDetect_cfg_private.h"

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version Check                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#if ((MIC_DETECT_C_MAJOR != MIC_DETECT_H_MAJOR) || \
     (MIC_DETECT_C_MINOR != MIC_DETECT_H_MINOR) || \
     (MIC_DETECT_C_PATCH != MIC_DETECT_H_PATCH))
#error "MicDetect_cfg.c and MicDetect.h : source and header files are inconsistent!"
#endif

#if ((MIC_DETECT_C_MAJOR != MIC_DETECT_CFG_PRIVATE_H_MAJOR) || \
     (MIC_DETECT_C_MINOR != MIC_DETECT_CFG_PRIVATE_H_MINOR) || \
     (MIC_DETECT_C_PATCH != MIC_DETECT_CFG_PRIVATE_H_PATCH))
#error "MicDetect_cfg.c and MicDetect_cfg_private.h : source and header files are inconsistent!"
#endif

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Literal Definitions                                                                                                              */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Macro Definitions                                                                                                                */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/* 定周期時間 */
#define MICDETECT_CYCTIM_MIC1                   (40U / MICDETECT_CYCTIM)
#define MICDETECT_CYCTIM_MIC2                   (40U / MICDETECT_CYCTIM)
#define MICDETECT_CYCTIM_MIC3                   (40U / MICDETECT_CYCTIM)
#define MICDETECT_CYCTIM_MIC4                   (40U / MICDETECT_CYCTIM)

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Type Definitions                                                                                                                 */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Variable Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Static Function Prototypes                                                                                                       */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Constant Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/* 車両信号ステータステーブル */
/* ポーリング開始条件成立から、1回目のポーリングまでの時間が10ms間隔である保証がないため、 */
/* 開始条件タイマのmin値をセットする場合は確実に時間制約を守るためにカウンタを+1している */
const   ST_MICDETECT_STS                        st_gp_MICDETECT_STS[MICDETECT_KIND_NUM] = {
    /*---------------MIC1検知-----------------------*/
    {
        (U1)0U,                                             /* 開始待ち時間(開始トリガ成立後即コールでOK) */
        vdp_PTR_NA,                                         /* 開始処理関数なし */
        (U1)MICDETECT_CYCTIM_MIC1,                          /* 定周期時間(40ms) */
        vd_g_MicDetect_Cyc,                                 /* 定周期処理関数 */
        vd_g_MicDetect_MicEnd,                              /* 終了処理関数 */
        (U1)3U,                                             /* 判定確定回数3回 */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Hi */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Lo */
        vd_g_XspiIviSub1ExtSgnlPut,                         /* データ通知関数 */
        vdp_PTR_NA                                          /* 端子制御関数なし */
    },
    /*---------------MIC2検知-----------------------*/
    {
        (U1)0U,                                             /* 開始待ち時間(開始トリガ成立後即コールでOK) */
        vdp_PTR_NA,                                         /* 開始処理関数なし */
        (U1)MICDETECT_CYCTIM_MIC2,                          /* 定周期時間(40ms) */
        vd_g_MicDetect_Cyc,                                 /* 定周期処理関数 */
        vd_g_MicDetect_MicEnd,                              /* 終了処理関数 */
        (U1)3U,                                             /* 判定確定回数3回 */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Hi */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Lo */
        vd_g_XspiIviSub1ExtSgnlPut,                         /* データ通知関数 */
        vdp_PTR_NA                                          /* 端子制御関数なし */
    },
    /*---------------MIC3検知-----------------------*/
    {
        (U1)0U,                                             /* 開始待ち時間(開始トリガ成立後即コールでOK) */
        vdp_PTR_NA,                                         /* 開始処理関数なし */
        (U1)MICDETECT_CYCTIM_MIC3,                          /* 定周期時間(40ms) */
        vd_g_MicDetect_Cyc,                                 /* 定周期処理関数 */
        vd_g_MicDetect_MicEnd,                              /* 終了処理関数 */
        (U1)3U,                                             /* 判定確定回数3回 */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Hi */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Lo */
        vd_g_XspiIviSub1ExtSgnlPut,                         /* データ通知関数 */
        vdp_PTR_NA                                          /* 端子制御関数なし */
    },
    /*---------------MIC4検知-----------------------*/
    {
        (U1)0U,                                             /* 開始待ち時間(開始トリガ成立後即コールでOK) */
        vdp_PTR_NA,                                         /* 開始処理関数なし */
        (U1)MICDETECT_CYCTIM_MIC4,                          /* 定周期時間(40ms) */
        vd_g_MicDetect_Cyc,                                 /* 定周期処理関数 */
        vd_g_MicDetect_MicEnd,                              /* 終了処理関数 */
        (U1)3U,                                             /* 判定確定回数3回 */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Hi */
        (U1)MICDETECT_TRG_MIC_ON_BIT,                       /* MIC-ON = Lo */
        vd_g_XspiIviSub1ExtSgnlPut,                         /* データ通知関数 */
        vdp_PTR_NA                                          /* 端子制御関数なし */
    }
};

const U1                                        u1_t_MICDETECT_CNVRT_ID[MICDETECT_KIND_NUM] = {
    (U1)XSPI_IVI_EXTSIG_MIC,            /* MIC-DET  */
    (U1)XSPI_IVI_EXTSIG_MIC2,           /* MIC2-DET */
    (U1)XSPI_IVI_EXTSIG_MIC3,           /* MIC3-DET */
    (U1)XSPI_IVI_EXTSIG_MIC4            /* MIC4-DET */
};

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Function Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/

/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Change History                                                                                                                   */
/*                                                                                                                                   */
/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Version  Date        Author   Change Description                                                                                 */
/* --------- ----------  -------  -------------------------------------------------------------------------------------------------- */
/*  0.0.0    02/21/2025  TN       New.                                                                                               */
/*                                                                                                                                   */
/*                                                                                                                                   */
/*  Revision    Date        Author   Change Description                                                                              */
/* ------------ ----------  -------  ----------------------------------------------------------------------------------------------- */
/*  BEVIVI-1    02/21/2025  TN       New.                                                                                            */
/*                                                                                                                                   */
/*  * TN   = Tetsu Naruse, Denso Techno                                                                                              */
/*                                                                                                                                   */
/*===================================================================================================================================*/