/* can_rscf3_eg_log_c_v3-0-0                                                */
/****************************************************************************/
/* Protected                                                                */
/* Copyright DENSO CORPORATION                                              */
/****************************************************************************/

/****************************************************************************/
/* Object Name  | CAN/RSCF3/EG/LOGICAL/CODE                                 */
/*--------------------------------------------------------------------------*/
/* Notes        |                                                           */
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/* Include Files                                                            */
/*--------------------------------------------------------------------------*/
#include <can/common/can_cm_log.h>
#include <can/common/can_syscfg_ext.h>

#include <Can.h>
#include <CanIf_Cbk.h>
#include "../../cfg/common/can_cv_cfg.h"
#include "../../cfg/rscf3/can_rscf3_cfg_ext.h"
#include "../../cfg/rscf3/can_rscf3_cfg.h"

#include <can/common/can_cv_can.h>
#include <can/common/can_cv_cbk.h>
#include <can/common/can_memmap.h>
#include <can/rscf3/can_rscf3.h>

#if (CAN_CFG_CAN == CAN_USE)
#include <can/rscf3/can_rscf3_tb_log.h>
#include <can/rscf3/can_rscf3_eg.h>


/*--------------------------------------------------------------------------*/
/* Macros                                                                   */
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/* Types                                                                    */
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/* Function Prototypes                                                      */
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/* Data                                                                     */
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/* Constants                                                                */
/*--------------------------------------------------------------------------*/


/****************************************************************************/
/* External Functions                                                       */
/****************************************************************************/
/****************************************************************************/
/* Function Name | Can_EdgeInit                                             */
/* Description   | エッジ検出初期化                                         */
/* Preconditions | -                                                        */
/* Parameters    | uint8 Controller :                                       */
/*               |   エッジ検出の初期化設定を実施するCANコントローラ        */
/* Return Value  | なし                                                     */
/* Notes         | ・スリープ機能未使用の場合は空関数とする。               */
/*               | ・引数チェックは関数呼び出し元で実施するものとし、本関数 */
/*               |   内では実施しない。                                     */
/****************************************************************************/
void
Can_EdgeInit( uint8 Controller )
{
#if (CAN_CFG_SLEEP == CAN_USE)
    /* ユーザ実装関数によるエッジ検出機能の初期化 */
    Can_UEdgeInit( Controller );
#endif /* (CAN_CFG_SLEEP == CAN_USE) */
}


/****************************************************************************/
/* Function Name | Can_EdgeEnableDetect                                     */
/* Description   | エッジ検出許可                                           */
/* Preconditions | -                                                        */
/* Parameters    | uint8 Controller :                                       */
/*               |   エッジ検出を開始するCANコントローラ                    */
/* Return Value  | なし                                                     */
/* Notes         | ・スリープ機能未使用の場合は空関数とする。               */
/*               | ・引数チェックは関数呼び出し元で実施するものとし、本関数 */
/*               |   内では実施しない。                                     */
/****************************************************************************/
void
Can_EdgeEnableDetect( uint8 Controller )
{
#if (CAN_CFG_SLEEP == CAN_USE)
    /* ユーザ実装関数によるエッジ検出の許可 */
    Can_UEdgeEnableDetect( Controller );
#endif /* (CAN_CFG_SLEEP == CAN_USE) */
}


/****************************************************************************/
/* Function Name | Can_EdgeDisableDetect                                    */
/* Description   | エッジ検出禁止                                           */
/* Preconditions | -                                                        */
/* Parameters    | uint8 Controller :                                       */
/*               |   エッジ検出を停止するCANコントローラ                    */
/* Return Value  | なし                                                     */
/* Notes         | ・スリープ機能未使用の場合は空関数とする。               */
/*               | ・引数チェックは関数呼び出し元で実施するものとし、本関数 */
/*               |   内では実施しない。                                     */
/****************************************************************************/
void
Can_EdgeDisableDetect( uint8 Controller )
{
#if (CAN_CFG_SLEEP == CAN_USE)
    /* ユーザ実装関数によるエッジ検出の禁止 */
    Can_UEdgeDisableDetect( Controller );
#endif /* (CAN_CFG_SLEEP == CAN_USE) */
}


/****************************************************************************/
/* Function Name | Can_EdgeClearStatus                                      */
/* Description   | エッジ検出履歴クリア                                     */
/* Preconditions | -                                                        */
/* Parameters    | uint8 Controller :                                       */
/*               |   エッジ検出履歴をクリアするCANコントローラ              */
/* Return Value  | なし                                                     */
/* Notes         | ・スリープ機能未使用の場合は空関数とする。               */
/*               | ・引数チェックは関数呼び出し元で実施するものとし、本関数 */
/*               |   内では実施しない。                                     */
/****************************************************************************/
void
Can_EdgeClearStatus( uint8 Controller )
{
#if (CAN_CFG_SLEEP == CAN_USE)
    /* ユーザ実装関数によるエッジ検出履歴のクリア */
    Can_UEdgeClearStatus( Controller );
#endif /* (CAN_CFG_SLEEP == CAN_USE) */
}


/****************************************************************************/
/* Function Name | Can_EdgeGetStatus                                        */
/* Description   | エッジ検出履歴取得                                       */
/* Preconditions | -                                                        */
/* Parameters    | uint8 Controller :                                       */
/*               |   エッジ検出履歴を取得するCANコントローラ                */
/* Return Value  | Can_ReturnType エッジ検出履歴                            */
/*               |   CAN_OK     : エッジ発生(エッジ検出履歴あり)            */
/*               |   CAN_NOT_OK : エッジ未発生(エッジ検出履歴なし)          */
/* Notes         | ・スリープ機能未使用の場合は空関数とし、エッジ未発生を   */
/*               |   応答する。                                             */
/*               | ・引数チェックは関数呼び出し元で実施するものとし、本関数 */
/*               |   内では実施しない。                                     */
/****************************************************************************/
Can_ReturnType
Can_EdgeGetStatus( uint8 Controller )
{
#if (CAN_CFG_SLEEP == CAN_USE)
    uint8  u1Ret;           /* 戻り値 */

    /* ユーザ実装関数によるエッジ検出履歴の取得 */
    u1Ret = Can_UEdgeGetStatus( Controller );
    return (u1Ret);
#else /* (CAN_CFG_SLEEP != CAN_USE) */
    /* スリープ機能未使用時             */
    /* 本ケースではエッジ未発生とする。 */
    return ((uint8)CAN_NOT_OK);
#endif /* (CAN_CFG_SLEEP) */
}


/****************************************************************************/
/* Internal Functions                                                       */
/****************************************************************************/


#endif /* (CAN_CFG_CAN == CAN_USE) */

/****************************************************************************/
/* History                                                                  */
/*  Version        :Date                                                    */
/*  v2-1-0         :2017/08/31                                              */
/*  v2-2-0         :2020/02/26                                              */
/*  v3-0-0         :2025/02/13                                              */
/****************************************************************************/

/**** End of File ***********************************************************/
