/*****************************************************************************
 *	Copyright DENSO Corporation. All rights reserved.
 ****************************************************************************/
/*****************************************************************************
 *【ファイル名�?    22SS_Callout.c
 *【モジュール名�?  22SS Callout
 *【機�?��?
 *【備�?�?
 ****************************************************************************/
/*----------------------------------------------------------------------------
 *		ヘッダインクルー�?
 *--------------------------------------------------------------------------*/
#include <Std_Types.h>
#include <SS.h>
#include "OS.h"

#include <Ecu_Memmap_SdaDisableB_env.h>
#include <Ecu_Memmap.h>
#include <22SS_Callout.h>

#include "stub.h"
#include "veh_opemd.h"
#include "oxcan.h"

/* Memory               */
#include "rim_ctl.h"
/* #include "nvmc_mgr.h" */

#include "EthSW_Task.h"
#include "Mcu_PwrCtrl.h"

#include "chipcom.h"
#include "VIS.h"

/*----------------------------------------------------------------------------
 *		置換シンボル定義
 *--------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *		変数宣言
 *--------------------------------------------------------------------------*/

#include <Ecu_Memmap_SdaDisableE_env.h>

/*----------------------------------------------------------------------------
 *      プロトタイプ宣言
 *--------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *		プログラ�?
 *--------------------------------------------------------------------------*/

/*===================================================================================================================================*/
/*  void    vd_g_22SSCallout_StaBonInit(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void vd_g_22SSCallout_StaBonInit(void)
{
/*    U1    u1_t_rslt;     */

    /*****************************************************/
    /* Rim, Nvmc Init Function should be called at first */
    /*****************************************************/
    vd_g_Rim_BonInit();

    /* 仮?��Nvmc起動時処�?                                         */
    /* ※Bon/Wkup判定条件は仮                                     */
    /*     BRAMが正常か否かで�?り�??ける(起動時に�?ずどちらかを実施)  */
    /* RIMでRAMチェ�?クした結果も�?慮して、Bon/Wkupを�??り�??けるべき�?*/
    /* (他�?�部品もそ�?�基準でBon/Wkupを�??り�??けて�?るものがある�?��?)  */
/*    vd_g_Nvmc_BonInit(); */
/*    do{  */
/*        u1_t_rslt = u1_g_Nvmc_BonRead(); */
/*    }while(u1_t_rslt != (U1)FALSE); */

    vd_g_oXCANRstInit();
    vd_g_VehopemdRstInit();

    /* vv User Hook start vv */
    vd_g_StubBonInit();
    vd_g_Mcu_PwrCtrl_Bon_Wakeup_Req();
    EthSW_StaBonInit();
    ChipCom_Init();
    vd_g_VISInit();
    /* ^^ User Hook end   ^^ */

    /*******************************************************************/
    /* vd_g_Rim_PostInit should be called after all user init function */
    /*******************************************************************/
    vd_g_Rim_PostInit();
}
/*===================================================================================================================================*/
/*  void    vd_g_22SSCallout_StaRstInit(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void vd_g_22SSCallout_StaRstInit(void)
{
/*    U1    u1_t_rslt;     */

    /*****************************************************/
    /* Rim, Nvmc Init Function should be called at first */
    /*****************************************************/
    vd_g_Rim_BonInit();

    /* 仮?��Nvmc起動時処�?                                         */
    /* ※Bon/Wkup判定条件は仮                                     */
    /*     BRAMが正常か否かで�?り�??ける(起動時に�?ずどちらかを実施)  */
    /* RIMでRAMチェ�?クした結果も�?慮して、Bon/Wkupを�??り�??けるべき�?*/
    /* (他�?�部品もそ�?�基準でBon/Wkupを�??り�??けて�?るものがある�?��?)  */
/*    vd_g_Nvmc_BonInit(); */
/*    do{  */
/*        u1_t_rslt = u1_g_Nvmc_BonRead(); */
/*    }while(u1_t_rslt != (U1)FALSE); */

    vd_g_oXCANRstInit();
    vd_g_VehopemdRstInit();

    /* vv User Hook start vv */
    vd_g_StubRstInit();
    vd_g_Mcu_PwrCtrl_Bon_Wakeup_Req();
    EthSW_StaRstInit();
    ChipCom_Init();
    vd_g_VISInit();
    /* ^^ User Hook end   ^^ */

    /*******************************************************************/
    /* vd_g_Rim_PostInit should be called after all user init function */
    /*******************************************************************/
    vd_g_Rim_PostInit();
}
/*===================================================================================================================================*/
/*  void    vd_g_22SSCallout_StaWkupInit(void)                                                                                       */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void vd_g_22SSCallout_StaWkupInit(void)
{
/*    U1    u1_t_rslt;     */

    /*****************************************************/
    /* Rim, Nvmc Init Function should be called at first */
    /*****************************************************/
    vd_g_Rim_WkupInit();

    /* 仮?��Nvmc起動時処�?                                         */
    /* ※Bon/Wkup判定条件は仮                                     */
    /*     BRAMが正常か否かで�?り�??ける(起動時に�?ずどちらかを実施)  */
    /* RIMでRAMチェ�?クした結果も�?慮して、Bon/Wkupを�??り�??けるべき�?*/
    /* (他�?�部品もそ�?�基準でBon/Wkupを�??り�??けて�?るものがある�?��?)  */
/*    vd_g_Nvmc_WkupInit(); */
/*    do{  */
/*        u1_t_rslt = u1_g_Nvmc_WkupRead(); */
/*    }while(u1_t_rslt != (U1)FALSE); */

    vd_g_oXCANWkupInit();
    vd_g_VehopemdWkupInit();

    /* vv User Hook start vv */
    vd_g_StubWkupInit();
    vd_g_Mcu_PwrCtrl_Bon_Wakeup_Req();
    EthSW_StaWkupInit();
    ChipCom_Init();
    vd_g_VISInit();
    /* ^^ User Hook end   ^^ */

    /*******************************************************************/
    /* vd_g_Rim_PostInit should be called after all user init function */
    /*******************************************************************/
    vd_g_Rim_PostInit();
}
/*===================================================================================================================================*/
/*  void    vd_g_22SSCallout_PrepShtdwn(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void vd_g_22SSCallout_PrepShtdwn(void)
{
}
