/* 1.0.0 */
/*===================================================================================================================================*/
/*  Copyright DENSO Corporation                                                                                                      */
/*===================================================================================================================================*/
/*  Renesas RH850/U2A : PORT Extension Interface For TOYOTA                                                                          */
/*                                                                                                                                   */
/*===================================================================================================================================*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version                                                                                                                          */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#define TYPORT_CALLOUT_C_MAJOR                  (1)
#define TYPORT_CALLOUT_C_MINOR                  (0)
#define TYPORT_CALLOUT_C_PATCH                  (0)

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Include Files                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#include "Port.h"
#include "Dio.h"

#include "typort_cfg_private.h"

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version Check                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#if ((TYPORT_CALLOUT_C_MAJOR != TYPORT_CFG_H_MAJOR) || \
     (TYPORT_CALLOUT_C_MINOR != TYPORT_CFG_H_MINOR) || \
     (TYPORT_CALLOUT_C_PATCH != TYPORT_CFG_H_PATCH))
#error "typort_callout.c and typort_cfg.h : source and header files are inconsistent!"
#endif

#if ((TYPORT_CALLOUT_C_MAJOR != TYPORT_CFG_PRIVATE_H_MAJOR) || \
     (TYPORT_CALLOUT_C_MINOR != TYPORT_CFG_PRIVATE_H_MINOR) || \
     (TYPORT_CALLOUT_C_PATCH != TYPORT_CFG_PRIVATE_H_PATCH))
#error "typort_callout.c and typort_cfg_private.h : source and header files are inconsistent!"
#endif

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Literal Definitions                                                                                                              */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Macro Definitions                                                                                                                */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/******************************************/
/* Pin Output Logic Holding Configuration */
/******************************************/
/* Wakeup時にスリープ前の出力を保持する機能の有効・無効設定 */
#define TYPORT_CFG_WAKEUP_IO_HOLD_AWO_ENABLE			(ON) /* AWO領域の端子 ON:有効 、OFF:無効 */
#define TYPORT_CFG_WAKEUP_IO_HOLD_ISO_ENABLE			(ON) /* ISO領域の端子 ON:有効 、OFF:無効 */

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Type Definitions                                                                                                                 */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
typedef struct{
    U2    u2_port_pin_id;
    U4    u4_port_pin_mode;
}ST_TYPORT_AWO_CFG;

typedef struct{
    U2    u2_dio_pin_id;
    U1    u1_dio_port_id;
}ST_TYPORT_ISO_CFG;

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Variable Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Static Function Prototypes                                                                                                       */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#define RH850_G4MH_SYNCP  /* static inline void  vd_s_SYNCP(void) */
#include "rh850_g4mh.h"

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Constant Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#pragma ghs section rodata=".TYPORT_RODATA_CONST"
/**************************************************************/
/* Wakeup時にスリープ前の出力を保持する端子の設定             */
/*                                                            */
/* ※テーブルの更新とあわせて、Portのコンフィグも変更すること */
/**************************************************************/
/* AWO領域の端子 */
/* (1)Port_Init()で、対象の端子に関するレジスタ操作を行わないようコンフィグする     */
/* (2)Port_SetPinMode()で、起動時の製品の仕様に沿った出力ができるようコンフィグする */
#if (TYPORT_CFG_WAKEUP_IO_HOLD_AWO_ENABLE == ON)
static const ST_TYPORT_AWO_CFG st_sp_TYPORT_AWO_CFG[]      = {
    {(U2)PORT_ID_PORT8_PIN0,   (U4)PORT_MODE_CFG_P8_0_DO_LO},
    {(U2)PORT_ID_PORT8_PIN2,   (U4)PORT_MODE_CFG_P8_2_DO_LO},
    {(U2)PORT_ID_APORT5_PIN1,  (U4)PORT_MODE_CFG_AP5_1_DO_LO}
};
static const U4 cu4_TYPORT_AWO_CFG_NUM = ((U4)sizeof(st_sp_TYPORT_AWO_CFG) / (U4)sizeof(st_sp_TYPORT_AWO_CFG[0]));
#endif

/* ISO領域の端子 */
/* (1)起動時のPort_Init()で対象端子のIOが入出力になるようコンフィグする     */
/* (2)DeepStop遷移時のPort_Init()でレジスタ操作を行わないようコンフィグする */
#if (TYPORT_CFG_WAKEUP_IO_HOLD_ISO_ENABLE == ON)
static const ST_TYPORT_ISO_CFG st_sp_TYPORT_ISO_CFG[]      = {
    {(U2)DIO_ID_PORT10_CH5, (U1)DIO_ID_PORT10}
};
static const U4 cu4_TYPORT_ISO_CFG_NUM = ((U4)sizeof(st_sp_TYPORT_ISO_CFG) / (U4)sizeof(st_sp_TYPORT_ISO_CFG[0]));
#endif
#pragma ghs section rodata=default

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Function Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#pragma ghs section text=".TYPORT_TEXT_CODE"
/*===================================================================================================================================*/
/*  void    vd_g_tyPortCalloutInit(const U1 u1_a_CFGID)                                                                              */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      --> u1_a_CFGID       : Configuration ID                                                                          */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void vd_g_tyPortCalloutInit(const U1 u1_a_CFGID)
{
#if (TYPORT_CFG_WAKEUP_IO_HOLD_AWO_ENABLE == ON)
    if(u1_a_CFGID == (U1)TYPORT_CFG_STA_BY_RST){
        
        U4 u4_t_awo_pin;
        
        for(u4_t_awo_pin = (U4)0U; u4_t_awo_pin < cu4_TYPORT_AWO_CFG_NUM; u4_t_awo_pin++){
            Port_SetPinMode(st_sp_TYPORT_AWO_CFG[u4_t_awo_pin].u2_port_pin_id, st_sp_TYPORT_AWO_CFG[u4_t_awo_pin].u4_port_pin_mode);
        }
    }
#endif
    
#if (TYPORT_CFG_WAKEUP_IO_HOLD_ISO_ENABLE == ON)
    if(u1_a_CFGID == (U1)TYPORT_CFG_STA_BY_WK){
        
        U4 u4_t_iso_pin;
        U1 u1_t_pin_lv;
        
        volatile U2 u2_t_port_lv;
        
        for(u4_t_iso_pin = (U4)0U; u4_t_iso_pin < cu4_TYPORT_ISO_CFG_NUM; u4_t_iso_pin++){
            
            u1_t_pin_lv = Dio_ReadChannel(st_sp_TYPORT_ISO_CFG[u4_t_iso_pin].u2_dio_pin_id);
            Dio_WriteChannel(st_sp_TYPORT_ISO_CFG[u4_t_iso_pin].u2_dio_pin_id, u1_t_pin_lv);
            u2_t_port_lv = Dio_ReadPort(st_sp_TYPORT_ISO_CFG[u4_t_iso_pin].u1_dio_port_id); /* DummyRead */
        }
        vd_s_SYNCP();
    }
#endif
    
    /* -------------------------------------------------------*/
    /* Attention :                                            */
    /* -------------------------------------------------------*/
    /* Pn/APn/JP0レジスタを変更しても端子出力には反映されない */
    /* vd_g_tyPortInit()後に反映される                        */
    /* -------------------------------------------------------*/
    
}
#pragma ghs section text=default

/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Change History                                                                                                                   */
/*                                                                                                                                   */
/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Version  Date        Author   Change Description                                                                                 */
/* --------- ----------  -------  -------------------------------------------------------------------------------------------------- */
/*  1.0.0     5/ 9/2025  RY       New.                                                                                               */
/*                                                                                                                                   */
/*  * RY   = Ryosuke Yamada                                                                                                          */
/*                                                                                                                                   */
/*===================================================================================================================================*/
