/* 1.0.0 */
/*===================================================================================================================================*/
/*  Copyright DENSO Corporation                                                                                                      */
/*===================================================================================================================================*/
/*  Audio Mute for 26CDC Models                                                                                                      */
/*                                                                                                                                   */
/*===================================================================================================================================*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version                                                                                                                          */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#define VOLMUTE_C_MAJOR                         (1)
#define VOLMUTE_C_MINOR                         (0)
#define VOLMUTE_C_PATCH                         (0)

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Include Files                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#include "volmute_cfg_private.h"

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version Check                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#if ((VOLMUTE_C_MAJOR != VOLMUTE_H_MAJOR) || \
     (VOLMUTE_C_MINOR != VOLMUTE_H_MINOR) || \
     (VOLMUTE_C_PATCH != VOLMUTE_H_PATCH))
#error "volmute.c and volmute.h : source and header files are inconsistent!"
#endif
#if ((VOLMUTE_C_MAJOR != VOLMUTE_CFG_PRIVATE_H_MAJOR) || \
     (VOLMUTE_C_MINOR != VOLMUTE_CFG_PRIVATE_H_MINOR) || \
     (VOLMUTE_C_PATCH != VOLMUTE_CFG_PRIVATE_H_PATCH))
#error "volmute.c and volmute_cfg_private.h : source and header files are inconsistent!"
#endif

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Literal Definitions                                                                                                              */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Macro Definitions                                                                                                                */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/* サンプリング監視対象 */
#define VOLMUTE_LSTNUM                          (2U)
#define VOLMUTE_LST_BU_DET_H                    (0U)
#define VOLMUTE_LST_T_MUTE                      (1U)

/* /BU-DET-H */
#define VOLMUTE_SMPLTIM_BUVOL                   (VOLMUTE_TASK)          /* サンプリング間隔 */
#define VOLMUTE_SCNT_BUVOL                      (1U)                    /* 同一論理判定確定回数 */

/* /T-MUTE */
#define VOLMUTE_SMPLTIM_TMUTE                   (10U / VOLMUTE_TASK)    /* サンプリング間隔 */
#define VOLMUTE_SCNT_TMUTE                      (3U)                    /* 同一論理判定確定回数 */

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Type Definitions                                                                                                                 */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
typedef struct {
    U1 *                        u1p_cyctim;             /* 前回サンプリングからの経過時間 */
    const U1                    u1_SMPLTIM;             /* サンプリング間隔 */
    U1  (* const                fp_GETPINSTS)(void);    /* PIN状態取得関数アドレス */
    const U1                    u1_SCNT;                /* 同一論理判定確定回数 */
    U1 *                        u1p_smplcnt;            /* サンプリング回数 */
    Dio_LevelType *             dlp_pinsts;             /* PIN状態確定値 */
    void (* const               fp_LOWFUNC)(void);      /* PIN状態：LOWで確定した時の処理関数 */
    void (* const               fp_HIGHFUNC)(void);     /* PIN状態：HIGHで確定した時の処理関数 */
} ST_VOLMUTE_LST;

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Variable Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/* /BU-DET-H */
static U1                       u1_s_volmute_cyctim_buvol;
static U1                       u1_s_volmute_smplcnt_buvol;
static Dio_LevelType            dl_s_volmute_pinsts_buvol;

/* /T-MUTE */
static U1                       u1_s_volmute_cyctim_tmute;
static U1                       u1_s_volmute_smplcnt_tmute;
static Dio_LevelType            dl_s_volmute_pinsts_tmute;

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Static Function Prototypes                                                                                                       */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
static void     vd_s_VolmutePinChk(const U1 u1_a_ID);
static void     vd_s_VolmuteBuVolLowFunc(void);
static void     vd_s_VolmuteBuVolHighFunc(void);
static void     vd_s_VolmuteTMuteLowFunc(void);
static void     vd_s_VolmuteTMuteHighFunc(void);

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Constant Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
static const ST_VOLMUTE_LST st_sp_VOLMUTE_LST[VOLMUTE_LSTNUM] = {
    /* /BU-DET-H */
    {
        &u1_s_volmute_cyctim_buvol,
        (U1)VOLMUTE_SMPLTIM_BUVOL,
        u1_g_VolmuteCfgGetBuDetH,
        (U1)VOLMUTE_SCNT_BUVOL,
        &u1_s_volmute_smplcnt_buvol,
        &dl_s_volmute_pinsts_buvol,
        vd_s_VolmuteBuVolLowFunc,
        vd_s_VolmuteBuVolHighFunc
    },
    /* /T-MUTE */
    {
        &u1_s_volmute_cyctim_tmute,
        (U1)VOLMUTE_SMPLTIM_TMUTE,
        u1_g_VolmuteCfgGetTMute,
        (U1)VOLMUTE_SCNT_TMUTE,
        &u1_s_volmute_smplcnt_tmute,
        &dl_s_volmute_pinsts_tmute,
        vd_s_VolmuteTMuteLowFunc,
        vd_s_VolmuteTMuteHighFunc
    }
};

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Function Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*===================================================================================================================================*/
/* void            vd_g_VolmuteInit(void)                                                                                            */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void            vd_g_VolmuteInit(void)
{
    U4  u4_t_loop;  /* ループカウンタ */

    for(u4_t_loop = (U4)0U; u4_t_loop < (U4)VOLMUTE_LSTNUM; u4_t_loop++){
        *(st_sp_VOLMUTE_LST[u4_t_loop].u1p_cyctim)  = (U1)0U;
        *(st_sp_VOLMUTE_LST[u4_t_loop].u1p_smplcnt) = (U1)0U;
        *(st_sp_VOLMUTE_LST[u4_t_loop].dlp_pinsts)  = st_sp_VOLMUTE_LST[u4_t_loop].fp_GETPINSTS();
    }

    vd_g_VolmuteCfgInit();
}

/*===================================================================================================================================*/
/* void            vd_g_VolmuteMainTask(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void            vd_g_VolmuteMainTask(void)
{
    U4              u4_t_lstid;  /* リストID */

    for(u4_t_lstid = (U4)0U; u4_t_lstid < (U4)VOLMUTE_LSTNUM; u4_t_lstid++){
        (*(st_sp_VOLMUTE_LST[u4_t_lstid].u1p_cyctim))++;

        if(*(st_sp_VOLMUTE_LST[u4_t_lstid].u1p_cyctim) >= st_sp_VOLMUTE_LST[u4_t_lstid].u1_SMPLTIM){
            *(st_sp_VOLMUTE_LST[u4_t_lstid].u1p_cyctim) = (U1)0U;

            vd_s_VolmutePinChk(u4_t_lstid);
        }
    }
}

/*===================================================================================================================================*/
/* static void     vd_s_VolmutePinChk(const U1 u1_a_ID)                                                                              */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void     vd_s_VolmutePinChk(const U1 u1_a_ID)
{
    Dio_LevelType   dl_t_port;  /* Pin読み出し値 */

    dl_t_port = st_sp_VOLMUTE_LST[u1_a_ID].fp_GETPINSTS();

    if(*(st_sp_VOLMUTE_LST[u1_a_ID].dlp_pinsts) != dl_t_port){
        (*(st_sp_VOLMUTE_LST[u1_a_ID].u1p_smplcnt))++;

        if(*(st_sp_VOLMUTE_LST[u1_a_ID].u1p_smplcnt) >= st_sp_VOLMUTE_LST[u1_a_ID].u1_SCNT){
            *(st_sp_VOLMUTE_LST[u1_a_ID].u1p_smplcnt) = (U1)0U;

            if(dl_t_port == dl_g_VOLMUTE_LOW){
                st_sp_VOLMUTE_LST[u1_a_ID].fp_LOWFUNC();
            }
            else if(dl_t_port == dl_g_VOLMUTE_HIGH){
                st_sp_VOLMUTE_LST[u1_a_ID].fp_HIGHFUNC();
            }
            else{
                /* do nothing */
            }
            *(st_sp_VOLMUTE_LST[u1_a_ID].dlp_pinsts)  = dl_t_port;
        }
    }
}
/*===================================================================================================================================*/
/* static void     vd_s_VolmuteBuVolLowFunc(void)                                                                                    */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void     vd_s_VolmuteBuVolLowFunc(void)
{
    /* MUTE解除設定 */
    vd_g_VolmuteCfgSetUnMute();
}

/*===================================================================================================================================*/
/* static void     vd_s_VolmuteBuVolHighFunc(void)                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void     vd_s_VolmuteBuVolHighFunc(void)
{
    /* MUTE設定 */
    vd_g_VolmuteCfgSetMute();
}

/*===================================================================================================================================*/
/* static void     vd_s_VolmuteTMuteLowFunc(void)                                                                                    */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void     vd_s_VolmuteTMuteLowFunc(void)
{
    /* MUTE設定 */
    vd_g_VolmuteCfgSetMute();
    /* 200.102_50h T-MUTE状態通知：MUTE */
    vd_g_VolmuteCfgSendTMuteSts(u1_g_VOLMUTE_TMUTE_MUTE);
}

/*===================================================================================================================================*/
/* static void     vd_s_VolmuteTMuteHighFunc(void)                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void     vd_s_VolmuteTMuteHighFunc(void)
{
    /* MUTE解除設定 */
    vd_g_VolmuteCfgSetUnMute();
    /* 200.102_50h T-MUTE状態通知：UN MUTE */
    vd_g_VolmuteCfgSendTMuteSts(u1_g_VOLMUTE_TMUTE_UNMUTE);
}

/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Change History                                                                                                                   */
/*                                                                                                                                   */
/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Version  Date        Author   Change Description                                                                                 */
/* --------- ----------  -------  -------------------------------------------------------------------------------------------------- */
/*  1.0.0    05/13/2025  TN       New. Specification version 2.0                                                                     */
/*                                                                                                                                   */
/*  * TN   = Tetsu Naruse, Denso Techno                                                                                              */
/*                                                                                                                                   */
/*===================================================================================================================================*/
