/****************************************************************************/
/*  ファイル名      L3R.h                                                   */
/*  モジュール名    L3R                                                     */
/*  機能         L3R機能 外部公開ヘッダ                                     */
/*  備考                                                                    */
/*  変更履歴        V1.00   2015.4.10  Y.Yakata                             */
/*                  V2.00   2018.5.23  T.Yamamura                           */
/*                                 可変化対応                               */
/*                                 ・L3R_Scheduler.hのインクルード追加      */
/*                  V3.00   2018.11.21 Y.Katayama                           */
/*                                 中継改善(オブジェクト不変）              */
/****************************************************************************/

#ifndef L3R_H
#define L3R_H


#include "L3R_Scheduler.h"
#include "L3R_GateManager.h"
#include "L3R_CanMessageExt.h"
#include "L3R_FrmInfo.h"
#include "L3R_Fail.h"

/*----外部変数宣言･変数名置換マクロ-----------------------------------------*/


/*----プロトタイプ宣言------------------------------------------------------*/


#endif	/* L3R_H */
