/****************************************************************************/
/*  ファイル名      L3R_Timer.h                                             */
/*  モジュール名    タイマ                                                  */
/*  機能            タイマ管理                                              */
/*  備考                                                                    */
/*  変更履歴        V1.00   2013.05.13  Y.Kaseda                            */
/*                        新規作成            CGWコーディング規約 V1.00準拠 */
/*                  V1.01   2013.11.19  R.Moriyama                          */
/*                        PF変更対応(システムタイマインターフェースを変更)  */
/*                  V1.02	2016.02.26	T.Matsumoto                         */
/*                        過剰遅延棄却時の遅延対応                          */
/*                        u2g_GW_RTR_Timer_GetTime()を変更					*/
/*                  V2.00   2018.11.21 Y.Katayama                           */
/*                        中継改善(オブジェクト不変）                       */
/****************************************************************************/

#ifndef L3R_TIMER_H
#define L3R_TIMER_H

#include "aip_common.h"
#include "gpt_drv_frt.h"

/*----外部変数宣言･変数名置換マクロ-----------------------------------------*/
#define L3R_Timer_Frt()	    		(u4_g_Gpt_FrtGetUsElapsed(vdp_PTR_NA))
#define L3R_FRT_1_MS  		    	(1000U * GPT_FRT_1US)
#define L3R_FRT_1_US				(GPT_FRT_1US)
/*----プロトタイプ宣言------------------------------------------------------*/


#endif	/* L3R_TIMER_H */
