/* ErrH-r04-3000-0200-b-v00 */
/************************************************************************************************/
/*																								*/
/*		ErrH Driver																				*/
/*																								*/
/*		Copyright : DENSO CORPORATION															*/
/*																								*/
/************************************************************************************************/

#if 0 // zantei MPUは2月末非対応

#ifndef ERRH_PBG_H
#define ERRH_PBG_H

/*==============================================================================================*/
/*	include files																				*/
/*==============================================================================================*/
#include	errh_"reg_pbg.h"

/*==============================================================================================*/
/* defines / data types / structs / unions	/ macros											*/
/*==============================================================================================*/

/*==============================================================================================*/
/* functions																					*/
/*==============================================================================================*/
/*----------------------------------------------------------------------------------------------*/
/* API Functions																				*/
/*----------------------------------------------------------------------------------------------*/
/************************************************************************************************/
/* Service name		:	Set Mode & Start Guard													*/
/* Reentrancy		:	Non Re-entrant															*/
/* Parameters		:	GroupNum	- Group Number( 0～27 )										*/
/*					:	ChNum		- Channel Number( 0～15 )									*/
/*					:	Prot		- unPBGPROT0n Value											*/
/*					:	Spid		- unPBGPROT1n Value											*/
/* Return value		:	none																	*/
/* Caveats			:	・本APIはコア0からのコールに限定する。									*/
/*					:	・本APIはInit時の使用に限定する。										*/
/************************************************************************************************/
void	ErrH_Pbg_SetModeStartGuard( U1 t_u1GroupNum , U1 t_u1ChNum , U4 t_u4Prot , U4 t_u4Spid );

/************************************************************************************************/
/* Service name		:	PBG Clear Error 														*/
/* Reentrancy		:	Re-entrant																*/
/* Parameters (in)	:	ModuleNum - PBG Module Number( 300 ～ 327  )							*/
/* Return value		:	none																	*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
void	ErrH_Pbg_ClearError( U2 t_u2ModuleNum );

/************************************************************************************************/
/* Service name		:	PBG Get Error Status													*/
/* Reentrancy		:	Concurrency Safe														*/
/* Parameters (in)	:	ModuleNum - PBG Module Number( 300 ～ 327  )							*/
/* Return value		:	Error Status 															*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
U4	ErrH_Pbg_GetErrorStatus( U2 t_u2ModuleNum );

/************************************************************************************************/
/* Service name		:	PBG Get Error Address													*/
/* Reentrancy		:	Concurrency Safe														*/
/* Parameters (in)	:	ModuleNum - PBG Module Number( 300 ～ 327  )							*/
/* Return value		:	Error Address															*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
U4	ErrH_Pbg_GetErrAddress( U2 t_u2ModuleNum  );

/************************************************************************************************/
/* Service name		:	PBG Get Error Access info												*/
/* Reentrancy		:	Concurrency Safe														*/
/* Parameters (in)	:	ModuleNum - PBG Module Number( 300 ～ 327  )							*/
/* Return value		:	Error Access info														*/
/* Caveats			:	・本APIはECMアラーム割り込みからの実行に限定する。						*/
/*					:	・ECMアラーム割り込みにて通知した異常IDを本APIの引数として指定すること。*/
/************************************************************************************************/
U4	ErrH_Pbg_GetErrAccessInfo( U2 t_u2ModuleNum  );

/************************************************************************************************/
/* Service name		:	PBG Disable All Guard													*/
/* Reentrancy		:	Non Re-entrant															*/
/* Parameters (in)	:	Mnone																	*/
/* Return value		:	none																	*/
/* Caveats			:	・本APIはコア0からのコールに限定する。									*/
/*					:	・本APIはInit時の使用に限定する。										*/
/************************************************************************************************/
void	ErrH_Pbg_DisableAllGuard( void );

/*----------------------------------------------------------------------------------------------*/
/* Scheduled / Event Functions																	*/
/*----------------------------------------------------------------------------------------------*/


#endif /* ERRH_PBG_H */
#endif // zantei MPUは2月末非対応
/*-- End Of File -------------------------------------------------------------------------------*/
