/*****************************************************************************
 *	Copyright DENSO Corporation. All rights reserved.
 ****************************************************************************/
/*****************************************************************************
 * [File Name]		EcuM.h
 * [Module]			EcuM
 * [Function]		EcuM
 * [Notes]			インテグ対象の汎用BSWがAubistの場合に有効となる
 ****************************************************************************/

#ifndef ECUM_H
#define ECUM_H

/*----------------------------------------------------------------------------
 *		Prototypes
 *--------------------------------------------------------------------------*/
#if !defined(__LANGUAGE_ASM__)
#define EcuM_StartupTwo()

void EcuM_Init(void);
#endif /* !defined(__LANGUAGE_ASM__) */


#endif /* ECUM_H */
