/* 0.0.0 */
/*===================================================================================================================================*/
/*  Copyright DENSO TECHNO Corporation                                                                                               */
/*===================================================================================================================================*/
/*  Transmission and reception processing of XSPI communication data in IVI.                                                         */
/*===================================================================================================================================*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version                                                                                                                          */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#define XSPI_IVI_C_MAJOR                        (1)
#define XSPI_IVI_C_MINOR                        (0)
#define XSPI_IVI_C_PATCH                        (0)

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Include Files                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#include    "x_spi_ivi_private.h"
#include    "x_spi_ivi_sub0_private.h"
#include    "x_spi_ivi_sub1_private.h"
#include    "x_spi_ivi_sub2_private.h"
#include    "x_spi_ivi_sub4_private.h"

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version Check                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#if ((XSPI_IVI_C_MAJOR != XSPI_IVI_H_MAJOR) || \
     (XSPI_IVI_C_MINOR != XSPI_IVI_H_MINOR) || \
     (XSPI_IVI_C_PATCH != XSPI_IVI_H_PATCH))
#error "x_spi_ivi.c and x_spi_ivi.h : source and header files are inconsistent!"
#endif

#if ((XSPI_IVI_C_MAJOR != XSPI_IVI_PRIVATE_H_MAJOR) || \
     (XSPI_IVI_C_MINOR != XSPI_IVI_PRIVATE_H_MINOR) || \
     (XSPI_IVI_C_PATCH != XSPI_IVI_PRIVATE_H_PATCH))
#error "x_spi_ivi.c and x_spi_ivi_private.h : source and header files are inconsistent!"
#endif

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Literal Definitions                                                                                                              */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Macro Definitions                                                                                                                */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#define     XSPI_TRANS_RSLT_OK       (0U)
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Type Definitions                                                                                                                 */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Variable Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
U1              u1_g_XspiIviRcv[XSPI_FRM_MAX];          /* XSPIデータ受信用バッファ */

U1              u1_g_XspiIviSnd_flg;                    /* 次回送信データ作成可否 */
U1              u1_g_XspiIviSnd[XSPI_FRM_MAX];          /* XSPI 次回送信データバッファ */

U4              u4_s_xspi_ivi_task_cnt[XSPI_TASK_CNT_NUM];                 /* 送信周期用 */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Static Function Prototypes                                                                                                       */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
static void     vd_s_XspiIviInit(void);
static void     vd_s_XspiIviRoutine(void);
static void     vd_s_XspiIviAnaRcv(U1 * u1_ap_xspi_add);
static void     vd_s_XspiIviMakeSend(U1 * u1_ap_xspi_add);
static void     vd_s_XspiIviTaskCnt(void);
static void     vd_s_XSpiIviComvertU1(U1* u1_ap_data,U4* u4_ap_data_tra);
static void     vd_s_XSpiIviComvertU4(U1* u1_ap_data,U4* u4_ap_data_rec);

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Constant Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Function Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*===================================================================================================================================*/
/*  void            vd_g_XspiIviBonInit(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    初期化処理                                                                                                        */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void            vd_g_XspiIviBonInit(void)
{
    vd_s_XspiIviInit();
    vd_g_XspiIviSub1BonInit();
}

/*===================================================================================================================================*/
/*  void            vd_g_XspiIviBonInit(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    初期化処理                                                                                                        */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void            vd_g_XspiIviWkupInit(void)
{
    vd_s_XspiIviInit();
}
/*===================================================================================================================================*/
/*  void            vd_g_XspiIviBonInit(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    初期化処理                                                                                                        */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void            vd_g_XspiIviRstInit(void)
{
    vd_s_XspiIviInit();
}
/*===================================================================================================================================*/
/*  void            vd_s_XspiIviInit(void)                                                                                           */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    初期化処理                                                                                                        */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void     vd_s_XspiIviInit(void)
{
    /* 送受信バッファ,フラグ初期化 */
    vd_g_MemfillU1(&u1_g_XspiIviRcv[0], (U1)0x00, (U4)XSPI_FRM_MAX);

    u1_g_XspiIviSnd_flg = (U1)TRUE;
    vd_g_MemfillU1(&u1_g_XspiIviSnd[0], (U1)0x00, (U4)XSPI_FRM_MAX);

    /* 初期化処理 */
    vd_g_XspiIviQueueInit();
    vd_g_XspiIviSub4Init();
    vd_g_XspiIviSub2Init();
    vd_g_XspiIviSub1Init();
    vd_g_XspiIviSub0Init();
    vd_g_MemfillU4(&u4_s_xspi_ivi_task_cnt[0], (U4)0U, (U4)XSPI_TASK_CNT_NUM);
}

/*===================================================================================================================================*/
/*  void            vd_g_XspiIviMain1st(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    XSPI通信受信処理                                                                                                  */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void            vd_g_XspiIviMain1st(void)
{
    U1          u1_t_buf_rslt;
    U1          u1_t_trans_rslt;
    U4          u4_tp_rec_data[XSPI_FRM_MAX_WORD];

    u1_t_buf_rslt   = (U1)XSPI_NG;

    vd_g_MemfillU4(&u4_tp_rec_data[0], (U4)0U, (U4)XSPI_FRM_MAX_WORD);

    /* データ取得処理 */
    u1_t_buf_rslt = xspi_Read((U1)XSPI_CH_01, &u4_tp_rec_data[0], (U4)XSPI_FRM_MAX_WORD);

    if (u1_t_buf_rslt == (U1)XSPI_OK) {
        vd_s_XSpiIviComvertU4(&u1_g_XspiIviRcv[0],&u4_tp_rec_data[0]);
        u1_t_trans_rslt  = u1_g_XspiIviRcv[5552];
        u1_t_trans_rslt |= u1_g_XspiIviRcv[5553];
        u1_t_trans_rslt |= u1_g_XspiIviRcv[5554];
        u1_t_trans_rslt |= u1_g_XspiIviRcv[5555];
        if(u1_t_trans_rslt == (U1)XSPI_TRANS_RSLT_OK) {
            vd_s_XspiIviAnaRcv(&u1_g_XspiIviRcv[0]);
        }
    }
    else {
        /* 受信データの取得失敗 */
        /* do nothing */
    }
}

/*===================================================================================================================================*/
/*  void            vd_g_XspiIviMain2nd(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    XSPI通信送信処理                                                                                                  */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void            vd_g_XspiIviMain2nd(void)
{
    U1          u1_t_drvr_cond;
    U1          u1_t_buf_rslt;
    U4          u4_tp_tra_data[XSPI_FRM_MAX_WORD];

    u1_t_buf_rslt   = (U1)XSPI_NG;

    vd_g_MemfillU4(&u4_tp_tra_data[0], (U4)0U, (U4)XSPI_FRM_MAX_WORD);

    /* 定期監視処理 */
    vd_s_XspiIviRoutine();
    
    /* 次回送信データ作成処理 */
    if(u1_g_XspiIviSnd_flg == (U1)TRUE) {
        vd_s_XspiIviMakeSend(&u1_g_XspiIviSnd[0]);
        u1_g_XspiIviSnd_flg = (U1)FALSE;
    }

    /* XSPI通信ドライバ状態取得処理 */
    u1_t_drvr_cond = xspi_GetCondition((U1)XSPI_CH_01);

    if ((u1_t_drvr_cond == (U1)XSPI_DCOND_IDLE) || (u1_t_drvr_cond == (U1)XSPI_DCOND_TRANSMIT)) {
        /* 送信バッファアドレス取得処理 */
        vd_s_XSpiIviComvertU1(&u1_g_XspiIviSnd[0], &u4_tp_tra_data[0]);
        u1_t_buf_rslt = xspi_Write((U1)XSPI_CH_01, &u4_tp_tra_data[0], (U4)XSPI_FRM_MAX_WORD);
    }
    else {
        /* ドライバ状態が初期化前(XSPI_DCOND_INIT) or 通信無効(XSPI_DCOND_INVALID)なのでデータ送信スキップ */
        /* do nothing */
    }

    if (u1_t_buf_rslt == (U1)XSPI_OK) {
        /* 送信データ受け渡し完了 次回タスクで送信データの再作成 */
        u1_g_XspiIviSnd_flg = (U1)TRUE;
    }
    else {
        /* 送信データ受け渡し失敗 次回タスクで同じデータを再送するためフラグ更新はしない */
    }
    vd_s_XspiIviTaskCnt();
}

/*===================================================================================================================================*/
/*  static void     vd_s_XspiIviRoutine(void)                                                                                        */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    XSPI通信送信 定期監視                                                                                             */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void     vd_s_XspiIviRoutine(void)
{
    vd_g_XspiIviCANBusGet2M();
    vd_g_XspiIviCANBusGet5M();
    vd_g_XspiIviCANBusEventJdg();
    vd_g_XspiIviDrecSgnlGet();
    /* リプロ定期監視処理 */
    vd_g_XspiIviSub1Routine();
}

/*===================================================================================================================================*/
/*  static void            vd_s_XspiIviAnaRcv(U1 * u1_ap_xspi_add)                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    XSPI通信受信データのサブフレーム分割/解析処理                                                                       */
/*  Arguments:      u1_ap_xspi_add : XSPIバッファへのポインタ                                                                          */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void            vd_s_XspiIviAnaRcv(U1 * u1_ap_xspi_add)
{
    /* サブフレーム0(DiagCAN)データ解析処理 */
    vd_g_XspiIviSub0Ana(&u1_ap_xspi_add[8]);

    /* サブフレーム1(Misc通信)データ解析処理 */
    vd_g_XspiIviSub1Ana(&u1_ap_xspi_add[272]);

    /* サブフレーム2(Gyro)データ解析処理 */
    vd_g_XspiIviSub2Ana(&u1_ap_xspi_add[536]);

    /* サブフレーム4(CAN Data/Repro/LCAN Data)データ解析処理 */
    vd_g_XspiIviSub4Ana(&u1_ap_xspi_add[2040]);
}

/*===================================================================================================================================*/
/*  static void            vd_s_XspiIviMakeSend(U1 * u1_ap_xspi_add)                                                                 */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    XSPI通信送信データの作成処理                                                                                       */
/*  Arguments:      u1_ap_xspi_add : XSPIバッファへのポインタ                                                                          */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void            vd_s_XspiIviMakeSend(U1 * u1_ap_xspi_add)
{
    static const U1     u1_sp_XSPI_FRAME_HEADER[XSPI_IVI_HEADER] = {(U1)0x00U, (U1)0x22U, (U1)0x43U, (U1)0xC4U, (U1)0xFFU, (U1)0x00U, (U1)0x00U, (U1)0x00U};

    /* FrameHeaderの付与 */
    vd_g_MemcpyU1(&u1_ap_xspi_add[0], &u1_sp_XSPI_FRAME_HEADER[0], (U4)XSPI_IVI_HEADER);

    /* サブフレーム0(DiagCAN)用送信データ作成処理 */
    vd_g_XspiIviSub0Send(&u1_ap_xspi_add[8]);

    /* サブフレーム1(Misc通信)用送信データ作成処理 */
    vd_g_XspiIviSub1Send(&u1_ap_xspi_add[272]);

    /* サブフレーム2(Gyro)用送信データ作成処理 */
    vd_g_XspiIviSub2Send(&u1_ap_xspi_add[536]);

    /* サブフレーム4(CAN Data/Repro/LCAN Data)用送信データ作成処理 */
    vd_g_XspiIviSub4Send(&u1_ap_xspi_add[2040]);
}

/*===================================================================================================================================*/
/*  static void            vd_s_XspiIviTaskCnt(void)                                                                                 */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Description:    定期送信処理のタスクカウント                                                                                        */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void           vd_s_XspiIviTaskCnt(void){
    U4    u4_t_lpcnt;

    for(u4_t_lpcnt = (U4)0U; u4_t_lpcnt < (U4)XSPI_TASK_CNT_NUM; u4_t_lpcnt++) {
        if(u4_s_xspi_ivi_task_cnt[u4_t_lpcnt] < (U4)U4_MAX) {
            u4_s_xspi_ivi_task_cnt[u4_t_lpcnt]++;
        } else {
            u4_s_xspi_ivi_task_cnt[u4_t_lpcnt] = (U4)0U;
        }
    }
}

/*===================================================================================================================================*/
/*  static void    vd_s_XSpiIviComvertU1(U1* u1_ap_data,U4* u4_ap_data_tra)                                                          */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void    vd_s_XSpiIviComvertU1(U1* u1_ap_data,U4* u4_ap_data_tra)
{
    U4 u4_t_lpcnt;

    for(u4_t_lpcnt = (U4)0U; u4_t_lpcnt < (U4)XSPI_FRM_MAX_WORD; u4_t_lpcnt++){
        u4_ap_data_tra[u4_t_lpcnt]  = (((U4)u1_ap_data[(u4_t_lpcnt * 4)    ]       ) & (U4)0x000000FFU);
        u4_ap_data_tra[u4_t_lpcnt] |= (((U4)u1_ap_data[(u4_t_lpcnt * 4) + 1] <<  8U) & (U4)0x0000FF00U);
        u4_ap_data_tra[u4_t_lpcnt] |= (((U4)u1_ap_data[(u4_t_lpcnt * 4) + 2] << 16U) & (U4)0x00FF0000U);
        u4_ap_data_tra[u4_t_lpcnt] |= (((U4)u1_ap_data[(u4_t_lpcnt * 4) + 3] << 24U) & (U4)0xFF000000U);
    }
}

/*===================================================================================================================================*/
/*  static void    vd_s_XSpiIviComvertU4(U1* u1_ap_data,U4* u4_ap_data_rec)                                                          */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void    vd_s_XSpiIviComvertU4(U1* u1_ap_data,U4* u4_ap_data_rec)
{
    U4 u4_t_lpcnt;

    for(u4_t_lpcnt = (U4)0U; u4_t_lpcnt < (U4)XSPI_FRM_MAX_WORD; u4_t_lpcnt++){
        u1_ap_data[u4_t_lpcnt * 4]     = (U1)(u4_ap_data_rec[u4_t_lpcnt]  & (U4)0x000000FFU);
        u1_ap_data[(u4_t_lpcnt * 4)+1] = (U1)((u4_ap_data_rec[u4_t_lpcnt] & (U4)0x0000FF00U) >> 8U);
        u1_ap_data[(u4_t_lpcnt * 4)+2] = (U1)((u4_ap_data_rec[u4_t_lpcnt] & (U4)0x00FF0000U) >> 16U);
        u1_ap_data[(u4_t_lpcnt * 4)+3] = (U1)((u4_ap_data_rec[u4_t_lpcnt] & (U4)0xFF000000U) >> 24U);
    }
}

/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Change History                                                                                                                   */
/*                                                                                                                                   */
/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Version  Date        Author   Change Description                                                                                 */
/* --------- ----------  -------  -------------------------------------------------------------------------------------------------- */
/*  0.0.0    11/11/2024  TN       New.                                                                                               */
/*  1.0.0    03/02/2026  KT       Change for initialization function by B-ON, Wkup and Reset.                                        */
/*                                                                                                                                   */
/*  Revision Date        Author   Change Description                                                                                 */
/* --------- ----------  -------  -------------------------------------------------------------------------------------------------- */
/*                                                                                                                                   */
/*                                                                                                                                   */
/*  * TN   = Tetsu Naruse, Denso Techno                                                                                              */
/*  * KT   = Kenta Takaji, Denso Techno                                                                                              */
/*                                                                                                                                   */
/*===================================================================================================================================*/
