/****************************************************************************/
/*	Copyright DENSO Corporation. All rights reserved.                       */
/****************************************************************************/
/*************************************************************************//**
 * @file	Cid_Search.h
 * @brief	CANID探索
 * @details	
 * @note	なし
 * @date	v1.00	2022/09/22	T.Matsushita(FSI)		新規作成
 ****************************************************************************/

/*--------------------------------------------------------------------------*/
/*		２重インクルード防止												*/
/*--------------------------------------------------------------------------*/
#ifndef	CID_SEARCH_H
#define	CID_SEARCH_H


/*--------------------------------------------------------------------------*/
/*		ファイルインクルード												*/
/*--------------------------------------------------------------------------*/
#include "Std_Types.h"
#include "Can.h"


/*--------------------------------------------------------------------------*/
/*		マクロ定義															*/
/*--------------------------------------------------------------------------*/
#define CID_NOMALCANID_MAX				(0x7FFU)

#define CID_TCOV_CANCOM_BIT				(0xC0000000U) /* フォーマット判定ビット */
#define CID_TCOV_MSK_CANCOM				(~CID_TCOV_CANCOM_BIT)

#define CID_NULL						(NULL_PTR)

#define CID_ON							(1U)
#define CID_OFF							(0U)

#define CID_NO_SEARCH					(0xFFFFU)

/*--------------------------------------------------------------------------*/
/*		タイプ宣言															*/
/*--------------------------------------------------------------------------*/
/* CANID探索用テーブル タイプ宣言 */
typedef const struct CanidDataArraySetTag CanidDataArraySet;

/* CANID探索用テーブル 構造体定義 */
struct CanidDataArraySetTag {
	uint32 canid_s;				/* CANID(標準/拡張) */
	uint16 canmsgIndex;			/* L3Rに渡すINDEX */
	const uint16 *pCnidData;	/* CNIDSに渡すCANIDに対応したINDEX定義ポインタ */
};

/*--------------------------------------------------------------------------*/
/*		外部公開変数														*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*		関数マクロ															*/
/*--------------------------------------------------------------------------*/

 
/*--------------------------------------------------------------------------*/
/*		プロトタイプ宣言													*/
/*--------------------------------------------------------------------------*/
#define GW_CID_START_SEC_CODE
#include "GW_Cid_Memmap.h"

extern void Cid_Search_ReceiveCanData(uint8 rxCh, const CanMsgType* ptMsg);
extern uint16 Cid_Search_GetIndexNo(uint32 canId, const uint32 *pCanIdTableNow, uint16 canIdSearchMax);

#define GW_CID_STOP_SEC_CODE
#include "GW_Cid_Memmap.h"
/*--------------------------------------------------------------------------*/
/*		２重インクルード防止												*/
/*--------------------------------------------------------------------------*/
#endif	/* CID_SEARCH_H */
